[{"_id":947032,"snippet":"I've been doing web development for the past 6 years, using Html5, CSS3 with SASS, and various Javascript (ES6) frameworks (AngularJS, Angular2+, Vue.js) and libraries (jQuery, jQueryUI, Bootstrap)","categories":["html","css","javascript","angular","vue","jquery","bootstrap","bourbon","neat"]},{"_id":687523,"snippet":"I have experience using NodeJS for serving HTTP requests and as a build pipeline (webpack,testing,bundling etc)","categories":["node","webpack"]},{"_id":372895,"snippet":"I have used a few MV* frameworks such as AngularJS and Ruby, which both use a controller, and Angular2+, which is component based. ","categories":["angular","rails","ruby"]},{"_id":716138,"snippet":"I'm an Angular 6 / AngularCLI developer and have been developing in Angular (JS / 2+) for the past 3 years. My most recent project was an admin SPA dashboard for my firm's marketing team which pulls data from REST APIs such as Github and our project management service Trello, as well as other data relating to KPIs (Google Analytics, etc.)","categories":["angular","api"]},{"_id":472061,"snippet":"I have a firm grasp of build tooling as well, using such software as Webpack, Node.js, Jasmine Testing, SASS/LESS, Continuous Integration, Git, etc.","categories":["webpack","node","jasmine","sass","less","ci","git"]},{"_id":417409,"snippet":"I have also contributed to several open source projects using Node.js and Express - one that streams video files from a torrent to a browser, and one runs Express and a python script to add music from Youtube to a google music account.","categories":["opensource","node","express"]},{"_id":867678,"snippet":"I primarily use Angular 5 / AngularCLI and VueJS on the front end, but have extensive experience working with web services in other languages, libraries, and frameworks.","categories":["angular","vue"]},{"_id":545622,"snippet":"Hi, my name is Matt Cheah. I'm a web developer and designer with 5+ years of experience in the front and back-end. You can see some of my work here: www.mattcheah.com. ","categories":["intro"]},{"_id":711654,"snippet":"I am also well experienced with the Adobe Creative Suite and Technical SEO audits.","categories":["adobe","seo"]},{"_id":433149,"snippet":"I have 5 years of experience in development, working with PHP/Ruby/Node on the back end and Angular/Vue/vanilla JS and other Libraries on the front end. You can see some of my work here at www.mattcheah.com. ","categories":["intro","angular","vue","javascript","php","ruby","node"]},{"_id":761610,"snippet":"I'd like to learn more about your developer position - I have experience with all necessary qualifications in your listing, in addition to several years of doing SEO at a marketing firm, and multiple personal projects working with Web APIs and other services that require AJAX and JSON/XML. I hope to hear from you soon, thanks!\"","categories":["outro","ajax","seo","json","api"]},{"_id":452346,"snippet":"I am well acquainted with build tooling as well (Webpack, Npm scripts, Jasmine/Unit Tests, SASS, Continuous Integration, GitHub and Git hooks). ","categories":["webpack","npm","jasmine","sass","ci","git"]},{"_id":998482,"snippet":"Coming from a marketing background, I have 5+ years of experience in Photoshop, and Google Analytics setup (event tracking, A/B Testing, campaign analysis, etc.) ","categories":["marketing","adobe","analytics","seo"]},{"_id":374463,"snippet":"After reviewing your position I feel like I match all of your qualifications and I think I'd be a great fit for this team. I'd love to connect and find out how I can benefit your team. Thanks!","categories":["outro"]},{"_id":789817,"snippet":"I've been doing web dev for the past 5 years, working primarily in a LAMP stack on the back and but also using Rails/Node.js when required, and using Angular and Vue on the front end for the past 2 years.","categories":["intro","lamp","php","rails","node","angular","vue"]},{"_id":296938,"snippet":"I also created a proprietary lightweight PHP framework for the website that allows non-coders to easily edit and re-arrange templated content. ","categories":["php"]},{"_id":906903,"snippet":" I'm currently working for a law firm marketing team where i've created our dev environment to use node and webpack, and build with CircleCI on git commits to master. ","categories":["ci","node","webpack"]},{"_id":782275,"snippet":"Hi, my name is Matt Cheah. ","categories":["intro"]},{"_id":307091,"snippet":"I've been doing front and back-end web development for about 5 years, working primarily in a LAMP stack environment, and I'm looking for opportunities to grow in my PHP skills by working with people who create more complex applications. My recent PHP experience includes creating a proprietary templating framework for my company's marketing department that allows non-coders to customize new webpages, and creating lead generation service that instantiates a new Contact class every time someone contacts us, which is then run through spam checker APIs and validations, and sent out using the SendGrid Composer Library and stores everything in a MySQL database.","categories":["php","composer","mysql","api","lamp"]},{"_id":67576,"snippet":"I have not personally worked with Laravel, but I do have experience with other MVC frameworks like Ruby/Rails, which I have heard has a very similar ORM. ","categories":["laravel"]},{"_id":497647,"snippet":"I'm a self-starter and quick learner, and I think I could be a great addition to your team at [COMPANY HERE]. I hope to be able to meet with you and discuss the position further. Thanks, have a great day!","categories":["outro"]},{"_id":77090,"snippet":"I'm an Angular 6 Developer specializing in creating components that interact with web services and APIs for displaying dynamic data in a clean, professional, and responsive manner. ","categories":["angular","api"]},{"_id":826704,"snippet":"I'm an expert with HTML5 and CSS3, and I primarily using SASS as a preprocessor.","categories":["html","css","sass"]},{"_id":651944,"snippet":"When I need to write a lot of HTML and i'm not writing with the Angular templating environment, my go-to templating tool is Pug(Jade). ","categories":["html","angular","pug"]},{"_id":336587,"snippet":"I also have 5+ years of back-end development experience, working with PHP, Node.js, and MySQL and MongoDB. ","categories":["php","node","mongodb","mysql"]},{"_id":64965,"snippet":"I started learning development by editing Wordpress themes in PHP, and since then I have created my own PHP framework for templating, and worked with other back-end technologies like Node.js and Ruby/Rails. ","categories":["wordpress","php","node","rails","ruby"]},{"_id":550062,"snippet":"I've used Heroku for staging applications in development, and AWS for Lambda functions. ","categories":["heroku","aws"]},{"_id":521038,"snippet":"I primarily use MySQL for any database needs, but also have experience with NoSQL databases like MongoDB. ","categories":["mysql","mongodb"]},{"_id":666662,"snippet":"You can see my portfolio of work on my website at mattcheah.com, or view the code at github.com/mattcheah.","categories":["outro"]},{"_id":644290,"snippet":"I've also worked in the digital marketing space for several years, so I'm very well equipped at building out optimized websites for the most efficient user-experience without sacrificing design. ","categories":["ux","seo","optimization"]}]